---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicateDesignOption
source: html/6d2d0ffd-f244-40b1-46f4-142341e4e32b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicateDesignOption Property

Can't duplicate Design Option.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDuplicateDesignOption { get; }
```